---
kind: other
id: Methods.T:Autodesk.Revit.DB.CeilingType
source: html/5a5e1616-0af1-3b4a-fe83-25eada0d3ffa.htm
---
# CeilingType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.